In [1]:
import pickle
import pandas as pd

In [ ]:
#!pip install pandas

# Another way to store data (pickle)

In [ ]:
#data = [{'name': 'Lex'}]
#data = [{'name': 'Lex', 'surname': 'Boerhoop'}]
data = [{'name': 'Lex', 'surname': 'Boerhoop'}, 
        {'name': 'Bert', 'surname': 'ten Braber'}]

with open('users.pkl', 'wb') as f:
    pickle.dump(data, f)  # pickle.dump

In [ ]:
data_from_pkl = pickle.load(open('users.pkl', 'rb'))
print(data_from_pkl, type(data_from_pkl))

In [ ]:
df = pd.DataFrame(data)
df

In [ ]:
df.to_pickle('df_pkl')

In [ ]:
df2 = pd.read_pickle('df_pkl')
df2

In [ ]:
df.to_csv('my_df.csv', index=False)

In [ ]:
# !pip install sqlalchemy

# SQLAlchemy 
SQLAlchemy & Django have the a similar object-relational mapping (aka ORM) are ways to connect Python to a SQL database.

In [2]:
from dataclasses import dataclass

@dataclass
class Movie:
    name:str = 'Unknown'
    genre:str = 'Action'
    year:int = None


#class Movie:
#    name = 'Unknown'
#    genre = 'Action'
#   
#    def __init__(self, name='', *args, **kwargs):
#        super().__init__(*args, **kwargs)
#        self.name = name

In [ ]:
movie_obj = Movie(name='Instellar')
movie_obj.name

In [ ]:
movie_obj.year

In [ ]:
data = [{
    'name': 'Interstallar',
    'genre': 'Sci-Fi'
},
{
    'name': 'The Martian',
    'genre': 'Sci-Fi'
},
{
    'name': 'Arrival',
    'genre': 'Sci-Fi'
},    
]

In [ ]:
df = pd.DataFrame(data)
df

# SQLAlchemy

In [4]:
import sqlalchemy
from sqlalchemy import create_engine, Column, String, Integer
from sqlalchemy.orm import sessionmaker

In [ ]:
engine = create_engine('sqlite:///app.db')  # mysql, postgress

In [ ]:
Session = sessionmaker(bind=engine)    # create Session class
my_sess = Session()

In [13]:
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()

In [14]:
class Movie(Base):                              # table
    __tablename__ = 'movies'
    
    id = Column(Integer, primary_key=True)      # auto created for us
    name = Column(String)                       # 'Unknown'      # col
    genre = Column(String)                      # 'Action'       # col
    description = Column(String)                                 # col
    year = Column(Integer, nullable=True)       # None           # col
    
    def __repr__(self):
        return f'<Movie name={self.name}>'
        
# saved instance = row

In [ ]:
# Add table to database
Base.metadata.create_all(engine)

In [ ]:
movie_obj = Movie(name='Interstellar', genre='Sci-Fi')
print(movie_obj.name)

In [ ]:
movie_obj.id

In [ ]:
my_sess.add(movie_obj)  # prepare to save
my_sess.commit()        # save

In [ ]:
print(movie_obj.id, movie_obj.description)

In [ ]:
movie_obj2 = Movie(name='The Martian', genre='Sci-Fi')
print(movie_obj2.name, movie_obj2.id)

In [ ]:
my_sess.add(movie_obj2)
my_sess.commit()

In [ ]:
print(movie_obj2.name, movie_obj2.id)

In [ ]:
movie_obj3 = Movie(name='Inception', genre='Sci-Fi')
movie_obj4 = Movie(name='Star Trek', genre='Sci-Fi')

my_sess.add(movie_obj3)
my_sess.add(movie_obj4)

my_sess.commit()

In [ ]:
print(movie_obj3.name, movie_obj3.id)
print(movie_obj4.name, movie_obj4.id)

# CRUD in SQLAlchemy
#### . (C)reate
#### . (R)etrieve
#### . (U)pdate
#### . (D)elete

In [ ]:
Session = sessionmaker(bind=engine)    # create Session class
session = Session()

In [ ]:
# Create
movie = Movie(name='Guaridans of the Galaxy')
session.add(movie)
session.commit()

In [ ]:
# Retrieve

# Get 1 item
movie_a = session.query(Movie).get(4)
print(movie_a.id, movie_a.name, movie.description)

In [ ]:
# List
qs = session.query(Movie).all()
print(qs)

In [ ]:
# List and Filter by Column Value
qs = session.query(Movie).filter_by(name='Guaridans of the Galaxy').all()
qs

In [ ]:
# List and Filter by Column Value Containing Something
my_query = input('What are you looking for?\n') or 'Unknown'
qs = session.query(Movie).filter(Movie.name.contains(my_query)).all()
qs

In [ ]:
# Update

movie_a = session.query(Movie).get(5)
movie_a.description = 'A Dream within a Dream'
print(movie_a.id, movie_a.name, movie.description)
session.commit()

In [ ]:
movie_a = session.query(Movie).get(5)
print(movie_a.description)

In [ ]:
movie_a = session.query(Movie).get(5)
print(movie_a.description)

In [ ]:
qs = session.query(Movie).filter(Movie.name.contains('Guaridans')).all()
for movie_obj in qs:
    movie_obj.name = 'Guardians of the Galaxy'
session.commit()

In [ ]:
movie_a = session.query(Movie).get(5)
print(movie_a.id, movie_a.name, movie_a.description)

In [ ]:
qs = session.query(Movie).filter(Movie.name.contains('Guaridans')).all()
qs

In [ ]:
# Delete

movie_a = session.query(Movie).get(5)
session.delete(movie_a)
session.commit()

In [ ]:
movie_a = session.query(Movie).get(5)
print(movie_a)

In [ ]:
session.flush()

In [ ]:
# !pip install pandas sqlacodegen

# SQLAlchemy & Pandas

In [ ]:
!sqlacodegen sqlite:///app2.db

In [ ]:
engine = create_engine('sqlite:///app2.db')
Session = sessionmaker(bind=engine)
session = Session()

In [ ]:
# coding: utf-8
from sqlalchemy import Column, Integer, String
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()
metadata = Base.metadata


class MovieApp2(Base):
    __tablename__ = 'movies'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    genre = Column(String)
    year = Column(Integer)
    
    def __repr__(self):
        return f'<Movie name={self.name}>'

In [ ]:
qs = session.query(MovieApp2).all()
print(qs)

In [ ]:
for old_obj in qs:
    #stored_data_dict = old_obj.__dict__
    #print(stored_data_dict)
    movie_obj = MovieApp2(name=old_obj.name, genre=old_obj.genre, year=old_obj.year)
    print(movie_obj.name, movie_obj.genre)
    session.add(movie_obj)
session.commit()

In [25]:
old_engine = create_engine('sqlite:///app2.db')
old_df = pd.read_sql_table('movies', old_engine)
old_df.head()

   id          name   genre  year
0   1   The Martian  Sci_Fi  None
1   2  Interstellar  Sci-Fi  None
2   3     Inception  Sci-Fi  None

In [26]:
current_engine = create_engine('sqlite:///app3.db')
current_df = pd.read_sql_table('movies', current_engine)
current_df

   id          name   genre             description  year
0   1  Interstellar  Sci-Fi                    None  None
1   2   The Martian  Sci-Fi  A Dream within a Dream  None
2   3     Inception  Sci-Fi                    None  None

In [23]:
# Delete rows

#Session = sessionmaker(bind=current_engine)
#session = Session()

#movie_a = session.query(Movie).get(4)
#session.delete(movie_a)
#session.commit()


# Update rows
#movie_a = session.query(Movie).get(2)
#print(movie_a)
#movie_a.description = 'A Dream within a Dream'
#print(movie_a.id, movie_a.name, movie_a.description)
#session.commit()
#session.flush()

In [29]:
final_df = pd.concat([current_df, old_df])
final_df.head(n=20)

   id          name   genre             description  year
0   1  Interstellar  Sci-Fi                    None  None
1   2   The Martian  Sci-Fi  A Dream within a Dream  None
2   3     Inception  Sci-Fi                    None  None
0   1   The Martian  Sci_Fi                     NaN  None
1   2  Interstellar  Sci-Fi                     NaN  None
2   3     Inception  Sci-Fi                     NaN  None

In [30]:
final_df = final_df[['name', 'genre', 'description', 'year']]
final_df.head(n=20)

           name   genre             description  year
0  Interstellar  Sci-Fi                    None  None
1   The Martian  Sci-Fi  A Dream within a Dream  None
2     Inception  Sci-Fi                    None  None
0   The Martian  Sci_Fi                     NaN  None
1  Interstellar  Sci-Fi                     NaN  None
2     Inception  Sci-Fi                     NaN  None

In [31]:
final_df = final_df[['name', 'genre', 'description', 'year']]
final_df.reset_index(inplace=True, drop=True)
final_df.head(n=20)

           name   genre             description  year
0  Interstellar  Sci-Fi                    None  None
1   The Martian  Sci-Fi  A Dream within a Dream  None
2     Inception  Sci-Fi                    None  None
3   The Martian  Sci_Fi                     NaN  None
4  Interstellar  Sci-Fi                     NaN  None
5     Inception  Sci-Fi                     NaN  None

In [33]:
final_df.to_sql(
    'movies-2',
    current_engine,
    dtype = {
        'name': String,
        'genre': String,
        'year': Integer,
        'description': String,
    }
)

In [35]:
!sqlacodegen sqlite:///app3.db

# coding: utf-8
from sqlalchemy import BigInteger, Column, Integer, String, Table
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()
metadata = Base.metadata


class Movie(Base):
    __tablename__ = 'movies'

    id = Column(Integer, primary_key=True)
    name = Column(String)
    genre = Column(String)
    description = Column(String)
    year = Column(Integer)


t_movies_2 = Table(
    'movies-2', metadata,
    Column('index', BigInteger, index=True),
    Column('name', String),
    Column('genre', String),
    Column('description', String),
    Column('year', Integer)
)

In [43]:
import sqlite3

conn = sqlite3.connect('app.db')

df = pd.read_sql_query('SELECT * FROM movies', conn)
df

   id          name   genre description  year
0   1  Interstellar  Sci-Fi        None  None
1   2   The Martian  Sci-Fi        None  None
2   3     Inception  Sci-Fi        None  None
3   4     Star Trek  Sci-Fi        None  None

In [44]:
conn2 = create_engine('sqlite:///app.db')
df = pd.read_sql_query('SELECT * FROM movies', conn2)
df

   id          name   genre description  year
0   1  Interstellar  Sci-Fi        None  None
1   2   The Martian  Sci-Fi        None  None
2   3     Inception  Sci-Fi        None  None
3   4     Star Trek  Sci-Fi        None  None